Documents/ЗагрузкаЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗагрузкаЛидов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Конверсии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Конверсии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторИгрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКонверсии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонверсий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДепозита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Конверсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Конверсии</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Кампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Лиды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Депозиты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДепозитов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыКонверсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонверсий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лид</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депозит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗагрузкаЛидов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Оффер = Кампания.Оффер;
	КапаЛидов = Оффер.КапаЛидовВМесяц;
	
	НовыхЛидов = 0;
	Для Каждого СтрокаКонверсии Из Конверсии Цикл
		Если СтрокаКонверсии.ТипКонверсии = Перечисления.ТипыКонверсий.Лид Тогда
			НовыхЛидов = НовыхЛидов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если КапаЛидов > 0 И НовыхЛидов > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Конверсии.Лиды), 0) КАК Лидов
		|ИЗ
		|	РегистрНакопления.Конверсии КАК Конверсии
		|ГДЕ
		|	Конверсии.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И Конверсии.Кампания.Оффер = &Оффер
		|	И Конверсии.Регистратор <> &Ссылка
		|	И Конверсии.Активность";
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("Оффер", Оффер);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		ЛидовЗаМесяц = 0;
		Если Выборка.Следующий() Тогда
			ЛидовЗаМесяц = Выборка.Лидов;
		КонецЕсли;
		Если ЛидовЗаМесяц + НовыхЛидов > КапаЛидов Тогда
			Сообщить(СтрШаблон("Превышена капа лидов по офферу ""%1"": капа %2, уже загружено %3, новых %4.",
				Оффер, КапаЛидов, ЛидовЗаМесяц, НовыхЛидов));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Движения.Конверсии.Записывать = Истина;
	Для Каждого СтрокаКонверсии Из Конверсии Цикл
		Движение = Движения.Конверсии.Добавить();
		Движение.Период = Дата;
		Движение.Кампания = Кампания;
		Если СтрокаКонверсии.ТипКонверсии = Перечисления.ТипыКонверсий.Депозит Тогда
			Движение.Депозиты = 1;
			Движение.СуммаДепозитов = СтрокаКонверсии.СуммаДепозита;
		Иначе
			Движение.Лиды = 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьИзCSV(ТекстCSV) Экспорт
	
	Конверсии.Очистить();
	Для НомерСтроки = 1 По СтрЧислоСтрок(ТекстCSV) Цикл
		Строка = СтрПолучитьСтроку(ТекстCSV, НомерСтроки);
		Если ПустаяСтрока(Строка) Тогда
			Продолжить;
		КонецЕсли;
		Части = СтрРазделить(Строка, ";");
		Если Части.Количество() < 2 Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(Части[0]) = "ИдентификаторИгрока" Тогда
			Продолжить; // строка заголовка
		КонецЕсли;
		НоваяСтрока = Конверсии.Добавить();
		НоваяСтрока.ИдентификаторИгрока = СокрЛП(Части[0]);
		Если СокрЛП(Части[1]) = "Депозит" Тогда
			НоваяСтрока.ТипКонверсии = Перечисления.ТипыКонверсий.Депозит;
		Иначе
			НоваяСтрока.ТипКонверсии = Перечисления.ТипыКонверсий.Лид;
		КонецЕсли;
		Если Части.Количество() >= 3 И Не ПустаяСтрока(Части[2]) Тогда
			НоваяСтрока.СуммаДепозита = Число(СтрЗаменить(СокрЛП(Части[2]), ",", "."));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
